kex2017/ad7606/stm32_src/app/internal_ad_sample.c
/*
 * data_processor.c
 *
 *  Created on: Apr 16, 2019
 *      Author: xuke
 */
#include <stdint.h>
#include <math.h>
#include <string.h>
#include "fault_location_threads.h"

#include "thread.h"
#include "periph/rtt.h"
#include "internal_ad_sample.h"
#include "periph/stm32f10x_std_periph.h"
#include "timex.h"
#include "xtimer.h"
#include "log.h"
#include "heart_beat.h"
#include "x_delay.h"
#include "env_cfg.h"
#include "data_send.h"
#include "type_alias.h"

__IO uint16_t sample_buf[CHANNEL_COUNT * SAMPLE_COUNT];

uint16_t pf_adc1_channel_list[PF_CHANNEL_COUNT] = {10, 11};

static kernel_pid_t to_receive_pid;

static msg_t rcv_queue[8];

static int mutation_msg_is_done;

static float rms_data[PF_CHANNEL_COUNT] = {0};

static MUTATION_DATA mutation_data;

static int mutation_msg_is_done;
static int periodic_msg_is_done;

PF_DATA pf_data;

msg_t sample_done_msg;
msg_t send_mutation_msg;

int pf_set_threshold(uint8_t channel, uint16_t threshold)
{
    pf_data.pf_threshold_chanagerate[channel].pf_threshold = threshold;
    return 0;
}

uint16_t pf_get_threshold(uint8_t channel)
{
    return pf_data.pf_threshold_chanagerate[channel].pf_threshold;
}
uint16_t pf_get_changerate(uint8_t channel)
{
    return pf_data.pf_threshold_chanagerate[channel].pf_chanagerate;
}

void set_default_pf_threshold_rate(void)
{
    uint16_t threshold = 2000;
    for (int i = 0; i < CHANNEL_COUNT; i++)
    {
        pf_set_threshold(i, threshold);
        LOG_INFO("Set pf over current threshold for Channel %d: %d", i, threshold);
    }
}

void init_msg_send_is_done(void)
{
    mutation_msg_is_done = 1;
    periodic_msg_is_done = 1;
}

void send_mutation_msg_is_done(void)
{
    mutation_msg_is_done = 1;
}

void calc_rms(RAW_DATA *raw_data, float *rms_data)
{
    uint32_t quadratic_sum[CHANNEL_COUNT] = {0};

    for (int channel = 0; channel < CHANNEL_COUNT; channel++)
    {
        for (int i = 0; i < SAMPLE_COUNT; i++)
        {
            quadratic_sum[channel] += (uint32_t)((raw_data->data[CHANNEL_COUNT * i + channel] - 2048) * (raw_data->data[CHANNEL_COUNT * i + channel] - 2048));
        }
        rms_data[channel] = sqrt((double)quadratic_sum[channel] / SAMPLE_COUNT);
    }
}

int detect_mutation(float *rms_data)
{
    int i = 0;
    for (i = 0; i < CHANNEL_COUNT; i++)
    {
        if (rms_data[i] > pf_data.pf_threshold_chanagerate[i].pf_threshold)
        {
            return 1;
        }
    }

    return 0;
}

static kernel_pid_t self_pid;
static kernel_pid_t data_send_pf_pid;
RAW_DATA irq_packet[5];
msg_t irq_msg[5];
int irq_packet_i;

void pf_data_recv_hook(kernel_pid_t pid)
{
    data_send_pf_pid = pid;
}
static void pf_sample_buff_cb(void)
{
    if (irq_packet_i == 5)
    {
        irq_packet_i = 0;
    }
    // printf("====================/r/n");
    memset((void *)irq_packet[irq_packet_i].data, 0, CHANNEL_COUNT * SAMPLE_COUNT * 2);
    memcpy((void *)irq_packet[irq_packet_i].data, (void *)sample_buf, CHANNEL_COUNT * SAMPLE_COUNT * 2);
    irq_msg[irq_packet_i].content.ptr = (void *)&irq_packet[irq_packet_i];

    int ret = 0;
    ret = msg_try_send(&(irq_msg[irq_packet_i]), self_pid);

    if (ret == -1)
    {
        printf("data collection send msg error \r\n");
    }
    irq_packet_i++;
}

static void pf_sample_init(void)
{
    adc1_dma1_tim4_sample_init(pf_adc1_channel_list, CHANNEL_COUNT, SAMPLE_COUNT, SAMPLE_DURATION_MS, (uint16_t *)sample_buf);
    set_adc1_dma1_tim4_sample_done_cb(pf_sample_buff_cb);
}

void do_receive_pid_hook(kernel_pid_t pid)
{
    to_receive_pid = pid;
}

int do_periodic_task;
int general_call_task;
msg_t send_periodic_msg;
msg_t send_general_call_msg;
static PERIODIC_DATA periodic_data;
static GENERAL_CALL_DATA general_call_data;

void clear_periodic_task(void)
{
    do_periodic_task = 0;
}

void clear_general_call_task(void)
{
    general_call_task = 0;
}

void pf_general_call_rms(void)
{
    general_call_task = CALL_RMS;
}

void pf_general_call_waveform(void)
{
    general_call_task = CALL_WAVEFORM;
}

int get_pf_general_type(void)
{
    return general_call_task;
}

void init_task(void)
{
    clear_periodic_task();
    clear_general_call_task();
}
void *internal_ad_sample_serv(void *arg)
{
    (void)arg;
    msg_t msg;
    RAW_DATA *raw_data;
    init_task();
    init_msg_send_is_done();
    set_default_pf_threshold_rate();
    msg_init_queue(rcv_queue, 8);
    pf_sample_init();
    msg_receive(&msg);
    raw_data = (RAW_DATA *)(msg.content.ptr);

    while (1)
    {
        msg_receive(&msg);
        raw_data = (RAW_DATA *)(msg.content.ptr);
        calc_rms(raw_data, rms_data);

        if (detect_mutation(rms_data))
        {
            if (!mutation_msg_is_done)
            {
                printf("mutation data not send done\r\n");
                continue;
            }
            mutation_data.rms_data[0] = rms_data[0] ;
            mutation_data.rms_data[1] = rms_data[1] ;
            for (int i = 0; i < SAMPLE_COUNT; i++)
            {
                mutation_data.channel1[i] = raw_data->data[CHANNEL_COUNT * i + 0];
                mutation_data.channel2[i] = raw_data->data[CHANNEL_COUNT * i + 1];
            }
            send_mutation_msg.type = PF_MUTATION_TYPE;
            send_mutation_msg.content.ptr = (void *)(&(mutation_data));
            msg_send(&(send_mutation_msg), data_send_pf_pid);
            mutation_msg_is_done = 0;
            do_periodic_task = 0;
            general_call_task = 0;
        }
        else
        {
            if (general_call_task)
            {

                for (int i = 0; i < SAMPLE_COUNT; i++)
                {
                    general_call_data.channel1[i] = raw_data->data[CHANNEL_COUNT * i + 0];
                    general_call_data.channel2[i] = raw_data->data[CHANNEL_COUNT * i + 1];
                }
                general_call_data.rms_data[0] = rms_data[0] ;
                general_call_data.rms_data[1] = rms_data[1] ;

                send_general_call_msg.type = GENERAL_CALL_DATA_TYPE;
                send_general_call_msg.content.ptr = (void *)(&general_call_data);
                msg_send(&send_general_call_msg, data_send_pf_pid);

                general_call_task = 0;
                continue;
            }
            if (do_periodic_task)
            {
                for (int i = 0; i < SAMPLE_COUNT; i++)
                {
                    periodic_data.channel1[i] = raw_data->data[CHANNEL_COUNT * i + 0];
                    periodic_data.channel2[i] = raw_data->data[CHANNEL_COUNT * i + 1];
                }
                periodic_data.rms_data[0] = rms_data[0] ;
                periodic_data.rms_data[1] = rms_data[1] ;

                send_periodic_msg.type = PF_PERIOD_DATA_TYPE;
                send_periodic_msg.content.ptr = (void *)(&periodic_data);
                msg_send(&send_periodic_msg, data_send_pf_pid);
                do_periodic_task = 0;
            }
        }
    }
}

void set_data_collection_receiver(kernel_pid_t pid)
{
    self_pid = pid;
}

static char internal_ad_sample_thread_stack[THREAD_STACKSIZE_MAIN];

kernel_pid_t internal_ad_sample_serv_init(void)
{
    kernel_pid_t _pid = thread_create(internal_ad_sample_thread_stack, sizeof(internal_ad_sample_thread_stack),
                                      INTERNAL_AD_SAMPLE_SERV_PRIORITY, THREAD_CREATE_STACKTEST, internal_ad_sample_serv, NULL,
                                      "Power frequency sample serv");
    set_data_collection_receiver(_pid);
    return _pid;
}

void pray_periodic_task(void)
{
    do_periodic_task = 1;
}
